In [4]:
import pandas as pd
from database import get_engine

In [19]:
import os
print(os.getcwd())

/Users/nicholashazzard/CPBaseball

In [20]:
from dotenv import load_dotenv, find_dotenv
import os

# Load .env no matter where you run from
load_dotenv(find_dotenv())

print("cwd:", os.getcwd())
print(".env found?", os.path.exists(".env"))
print("POSTGRES_URI:", os.getenv("POSTGRES_URI"))

cwd: /Users/nicholashazzard/CPBaseball
.env found? True
POSTGRES_URI: postgresql://postgres:Mustang1705%21221018@db.zefpsgjpactgpstcboxb.supabase.co:5432/postgres

In [61]:
engine = get_engine()
# https://pandas.pydata.org/docs/reference/api/pandas.read_sql.html
# Note: since our column names are capitalized, you must wrap each column in quotes
df1 = pd.read_sql("""
    SELECT *
    FROM all_college_2025
    WHERE "PitcherTeam" = 'CAL_POL';
""", con=engine)

df1

,PitchNo,Date,Time,PAofInning,PitchofPA,Pitcher,PitcherId,PitcherThrows,PitcherTeam,Batter,...,PitchTrajectoryXc0,PitchTrajectoryXc1,PitchTrajectoryXc2,PitchTrajectoryYc0,PitchTrajectoryYc1,PitchTrajectoryYc2,PitchTrajectoryZc0,PitchTrajectoryZc1,PitchTrajectoryZc2,HitSpinAxis
0,15.0,None,None,2.0,1.0,"Kovach, Luke",1.000118e+09,Left,CAL_POL,"McLaurin, Xander",...,None,None,None,None,None,None,None,None,None,None

In [ ]:
df = pd.read_sql("""
    SELECT "PitcherTeam", COUNT(*) AS n
    FROM all_college_2025
    GROUP BY "HitterTeam"
    ORDER BY n DESC;
""", con=engine)

df

    PitcherTeam      n
0       ARI_WIL  12348
1       SEA_RED   9662
2       TCU_HFG   9181
3       CLE_TIG   9123
4       LOU_CAR   8914
..          ...    ...
653    SOU_SOU3      3
654     NOR_COM      2
655    HAM_COL2      1
656     PUR_FOR      1
657     CAL_POL      1

[658 rows x 2 columns]

In [ ]:
engine = get_engine()
# https://pandas.pydata.org/docs/reference/api/pandas.read_sql.html
# Note: since our column names are capitalized, you must wrap each column in quotes
df2 = pd.read_sql("""
    SELECT *
    FROM all_college_2025
        WHERE "BatterTeam" = 'CAL_POL';
""", con=engine)

df2